Update diagram in MLOps system docs
